<?php

use Illuminate\Database\Seeder;

class AdsourcesSeeder extends Seeder
{
    public function run()
    {
        $adsources = [
            1 => 'Билет',
            2 => 'Из Сайта Финтерра',
            3 => 'Листовка В ПочтовомЯщике',
            4 => 'Листовки расклеянные на остановках',
            5 => 'Наружная реклама',
            6 => 'Озвучка в торговом центре',
            7 => "От знакомых, родственников",
            8 => 'Плакаты баннеры на улицах',
            9 => 'Постоянный Клиент',
            10 => 'По Флаеру Приведи Друга',
            11 => 'Промоутер',
            12 => 'Радио Точки На Остановках',
            13 => 'Резидент',
            14 => 'Реклама В Газете',
            15 => 'Реклама На Подголовниках В Автобусе',
            16 => 'Реклама На Телевидение',
            17 => 'Реклама На Телевидении',
            18 => 'СправочникДубльГис',
            19 => 'Увидели Стойку В Торговом Центре',
            20 => 'ooo',
            21 => 'СМС рассылка',
            22 => 'ooo',
            23 => 'ooo',
            24 => 'ooo',
            25 => 'ooo',
            26 => 'ooo',
            27 => 'ooo',
            28 => 'ooo',
            29 => 'ooo',
            30 => 'ooo',
            31 => 'ooo',
            32 => 'ooo',
            33 => 'ooo',
            34 => 'ooo',
            35 => 'ooo',
            36 => 'ooo',
            37 => 'ooo',
            38 => 'ooo',
            39 => 'ooo',
            40 => 'ooo',
            41 => 'ooo',
            42 => 'ooo',
            43 => 'ooo',
            44 => 'ooo',
            45 => 11,
            46 => 55,
            47 => 44,
            48 => 55,
            49 => 77,
        ];
        foreach ($adsources as $adsourcesId => $nameAdsources) {
            \App\AdSource::create([
                'id' => $adsourcesId,
                'name'=> $nameAdsources,
            ]);
        }
    }
}
