<?php

use Illuminate\Database\Seeder;

class RegionSeeder extends Seeder
{
    public function run()
    {
        $arrRegions = [
            1 => [
                'name' => 'Алтайский край',
                'created_at' => '2016-07-08 00:00:00',
                'updated_at' => '2016-07-08 00:00:00',
                'deleted_at' => '2018-12-24 00:00:00',
                'director' => 'Губанова Евгения Александровна'
            ],
            2 => [
                'name' => 'Кемеровская область (юг)',
                'created_at' => '2016-07-08 00:00:00',
                'updated_at' => '2016-07-08 00:00:00',
                'deleted_at' => '2018-12-24 00:00:00',
                'director' => 'Смокотина Юлия Юрьевна'
            ],
            3 => [
                'name' => 'Красноярский край',
                'created_at' => '2016-07-08 00:00:00',
                'updated_at' => '2016-07-08 00:00:00',
                'deleted_at' => '2018-12-24 00:00:00',
                'director' => 'Губанова Евгения Александровна'
            ],
            4 => [
                'name' => 'Новосибирская область',
                'created_at' => '2016-07-08 00:00:00',
                'updated_at' => '2016-07-08 00:00:00',
                'deleted_at' => '2018-12-24 00:00:00',
                'director' => 'Губанова Евгения Александровна'
            ],
            5 => [
                'name' => 'Кемеровская область (север)',
                'created_at' => '2016-07-08 00:00:00',
                'updated_at' => '2016-07-08 00:00:00',
                'deleted_at' => '2018-12-24 00:00:00',
                'director' => 'Шумакова Ирина Александровна'
            ],
            6 => [
                'name' => 'Омская область',
                'created_at' => '2017-02-01 00:00:00',
                'updated_at' => '2017-02-01 00:00:00',
                'deleted_at' => '2018-12-24 00:00:00',
                'director' => 'Губанова Евгения Александровна'
            ],
            7 => [
                'name' => 'Республика Башкортостан',
                'created_at' => '2018-08-10 00:00:00',
                'updated_at' => '2018-08-10 00:00:00',
                'deleted_at' => '2018-12-24 00:00:00',
                'director' => 'Губанова Евгения Александровна'
            ],
            8 => [
                'name' => 'Офис',
                'created_at' => '2018-12-20 00:00:00',
                'updated_at' => '2018-12-20 00:00:00',
                'director' => 'Попова Татьяна Анатольевна'
            ],
            9 => [
                'name' => 'Алтайский край',
                'created_at' => '2018-12-24 00:00:00',
                'updated_at' => '2018-12-24 00:00:00'
            ],
            10 => [
                'name' => 'Кемеровская область север',
                'created_at' => '2018-12-24 00:00:00',
                'updated_at' => '2018-12-24 00:00:00'
            ],
            11 => [
                'name' => 'Региональный центр Салехард',
                'created_at' => '2018-12-24 00:00:00',
                'updated_at' => '2018-12-24 00:00:00'
            ],
            12 => [
                'name' => 'Региональный центр Ханты-Мансийск',
                'created_at' => '2018-12-24 00:00:00',
                'updated_at' => '2018-12-24 00:00:00'
            ],
            13 => [
                'name' => 'Томская область',
                'created_at' => '2018-12-24 00:00:00',
                'updated_at' => '2018-12-24 00:00:00'
            ],
            14 => [
                'name' => 'Кемеровская область юг',
                'created_at' => '2018-12-24 00:00:00',
                'updated_at' => '2018-12-24 00:00:00'
            ],
            15 => [
                'name' => 'Республика тыва',
                'created_at' => '2018-12-24 00:00:00',
                'updated_at' => '2018-12-24 00:00:00'
            ],
            16 => [
                'name' => 'Красноярский край',
                'created_at' => '2018-12-24 00:00:00',
                'updated_at' => '2018-12-24 00:00:00'
            ],
            17 => [
                'name' => 'Новосибирская область',
                'created_at' => '2018-12-24 00:00:00',
                'updated_at' => '2018-12-24 00:00:00'
            ],
            18 => [
                'name' => 'Омская область',
                'created_at' => '2018-12-24 00:00:00',
                'updated_at' => '2018-12-24 00:00:00'
            ],
            19 => [
                'name' => 'Республика башкортостан',
                'created_at' => '2018-12-24 00:00:00',
                'updated_at' => '2018-12-24 00:00:00'
            ],
            20 => [
                'name' => 'Региональный центр Чита',
                'created_at' => '2018-12-24 00:00:00',
                'updated_at' => '2018-12-24 00:00:00'
            ],
            21 => [
                'name' => 'Республика бурятия',
                'created_at' => '2018-12-24 00:00:00',
                'updated_at' => '2018-12-24 00:00:00'
            ],
            22 => [
                'name' => 'Республика Хакасия',
                'created_at' => '2019-11-12 00:00:00',
                'updated_at' => '2019-11-12 00:00:00'
            ],
            23 => [
                'name' => 'Краснодарский край',
                'created_at' => '2020-02-18 00:00:00',
                'updated_at' => '2020-02-18 00:00:00',
                'director ' => 'Сахно Алексей Владимирович '
            ],
            24 => [
                'name' => 'Краснодар - Запад',
                'created_at' => '2020-04-17 00:00:00',
                'updated_at' => '2020-04-17 00:00:00'
            ],
            25 => [
                'name' => 'Краснодар - Восток',
                'created_at' => '2020-04-17 00:00:00',
                'updated_at' => '2020-04-17 00:00:00'
            ],
            27 => [
                'name' => 'Региональный центр Якутск',
                'created_at' => '2021-05-31 00:00:00',
                'updated_at' => '2021-05-31 00:00:00'
            ],
        ];

        foreach ($arrRegions as $region) {
            \App\Region::create([
               'name' => $region['name'],
               'created_at'=> $region['created_at'],
               'updated_at'=> $region['updated_at'],
               'deleted_at'=> $region['deleted_at'] ?? null,
               'director'=> $region['director'] ?? null,
            ]);
        }

    }
}
